9/data/attachments/ede62cc4d9b8d08d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Daniel_will_Friend_52970_7</nif:username>
            <nif:friendToBeRequested>soap_friends_058eefb2-d7a6-4289-8e9d-d1b68a887385</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>